# 30. Есть два файла: в одном хранятся ФИО пользователей сайта, 
# а в другом — данные об их хобби. Известно, что при хранении данных используется принцип: 
# одна строка — один пользователь. Написать код, загружающий данные из обоих 
# файлов и формирующий из них словарь: ключи — ФИО, значения — данные о хобби.

# Сохранить словарь в файл users_hobby.txt. 

# Фрагмент файла с данными о пользователях (users.txt):
# Иванов Иван Иванович
# Петров Петр Петрович
# Фрагмент файла с данными о хобби (hobby.txt):
# скалолазание, охота
# горные лыжи


keys = open('user.txt').read().split('\n')
values = open('hobby.txt').read().split('\n')
info = dict(zip(keys, values))
print(info)

import json
open('user_hobby.txt', 'w').write(json.dumps(info))










# 31. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# 32. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# 33. Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл многочлен степени k.

# Пример:
# k=2 => 2x² + 4x + 5 = 0 или x² + 5 = 0 или 10x² = 0
# 34. *Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.

# 2x² + 4x + 5 = 0 и x² + 5x + 3 = 0 => 3x² + 9x + 8 = 0
