# 17. Задайте список из N элементов, заполненных числами из промежутка [-N, N].
#  Найдите произведение элементов на введенных пользователем позициях.

number = int(input ('Введите целое число  '))
my_list = []
for i in range(- number,number +1):
    x = i
    my_list.append(x)
print(my_list)

def user(pos1: int, pos2: int, ):
    for i in user:
   #Не закончила
